---
kind: type
id: T:Autodesk.Revit.DB.IExportContextBase
source: html/6691ecd5-a88a-1f58-7a71-a8f6233b6c51.htm
---
# Autodesk.Revit.DB.IExportContextBase

An interface that as common base for IModelExportContext and IExportContext2D.

## Syntax (C#)
```csharp
public interface IExportContextBase : IExportContext
```